# Задайте список из n чисел последовательности $(1+\frac 1 n)^n$ и выведите на экран их сумму.

# N = int(input('Введите число: '))
# list = []
# sum = 0 
# for i in range(1, N+1):
#     Ni = round((1+(1/i))**i, 2)
#     list.append(Ni) 
#     sum += round(Ni,2)
# print(list)
# print(sum)