# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# Пример:
# - 6782 -> 23
# - 0,56 -> 11

# Num = input('Введите число: ')
# sum = 0
# for i in Num:
#     if i.isdigit():
#         sum += int(i)
# print(int(sum))
