# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# Пример:
# - 6782 -> 23
# - 0,56 -> 11
# ![text] (name_file.jpg)

# num = input("Введите вещественное число: ")
# x = num.split(".")
# a = int(x[0]) # целая часть
# b = int(x[1]) # дробная часть
# sum_a = 0
# sum_b = 0
# while (a != 0): 
#     sum_a = sum_a + (a % 10)
#     a = a // 10
# while (b != 0):
#     sum_b = sum_b + (b % 10)
#     b = b // 10
# sum = sum_a + sum_b
# print("Сумма цифр равна:", sum)